Revit 2027 API
FabricationServiceButton.IsExcluded Method
 Gets if the button's fabrication part content associated with the button is to be excluded from Route and Fill, Design to Fabrication, or Multi-Point Routing commands.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsExcluded()
Public Function IsExcluded As Boolean
public:
bool IsExcluded()
member IsExcluded : unit -> bool
Return Value
Boolean
 Returns true if the button's parts are excluded.
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace